{
  "reviews": [
    {
      "id": 1,
      "title": "Fancy from the outside",
      "date": 20190402,
      "recommend": false,
      "outlook": "neutral",
      "ceoOpinion": null,
      "balance": 2,
      "culture": 1,
      "careerOpps": 4,
      "benefits": 3,
      "mgmt": 3,
      "total": 1,
      "pros": "The name alone will get you in the door to other jobs",
      "cons": "Your role, opinion are not valued, pay is low compared to similar institutions. They depend on their name as compensation, but if your a real professional you contribute as much as they do and you should be compensated as such. No diversity, nonfriendly culture throughout every department.",
      "advice": null,
      "currentEmployee": false,
      "fullTime": false,
      "tenure": "<1",
      "role": "Nurse Clinician",
      "locationCity": "Chicago",
      "locationState": "IL"
    },

    {
      "id": 2,
      "title": "Great place to research!",
      "date": 20190404,
      "recommend": true,
      "outlook": "positive",
      "ceoOpinion": null,
      "balance": 5,
      "culture": 5,
      "careerOpps": 5,
      "benefits": 5,
      "mgmt": 5,
      "total": 5,
      "pros": "This is a great place to get a degree. Community is very supportive and encourages you to learn.",
      "cons": "Winters can be a bit rough being in Chicago, but that's true of every company here.",
      "advice": null,
      "currentEmployee": true,
      "fullTime": true,
      "tenure": ">5",
      "role": "PhD Candidate",
      "locationCity": "Chicago",
      "locationState": "IL"
    },

    {
      "id": 3,
      "title": "Hit & Miss",
      "date": 20150806,
      "recommend": false,
      "outlook": "neutral",
      "ceoOpinion": null,
      "balance": 3,
      "culture": 1,
      "careerOpps": 1,
      "benefits": 2,
      "mgmt": 2,
      "total": 3,
      "pros": "There are some absolutely great people working here doing great things. If you work with the right people, they'll help you grow and go to the mat for you. You do have to actively look and fight for new opportunities, but they're out there.",
      "cons": "Very closed environment that will throw you under the bus if you don't have someone watching your back. Unfortunately lots of favoritism in the hiring practices, and little in the way of competitive pay and benefits comparative to other peer universities.",
      "advice": "Open up meetings and opportunities for cross-communication. Communication as a whole in all aspects of the organization is severely lacking.",
      "currentEmployee": false,
      "fullTime": null,
      "tenure": null,
      "role": null,
      "locationCity": "Evanston",
      "locationState": "IL"
    },

    {
      "id": 4,
      "title": "Great College Job",
      "date": 20150430,
      "recommend": true,
      "outlook": "positive",
      "ceoOpinion": null,
      "balance": 5,
      "culture": 5,
      "careerOpps": 5,
      "benefits": 5,
      "mgmt": 5,
      "total": 5,
      "pros": "Great experience, great resume builder. This job allows you to be able to put quantifiable accomplishments on your resume. Offers promotions to grow.",
      "cons": "Sometimes being a caller may get boring or tiring. Every once in a while you will speak to a grumpy alum that might ruin your day, but this does not happen that often.",
      "advice": "Keep trying to improve the program as best as you can. Make sure to keep work environment fun and uplifting. Keep finding novel ways to keep room moral high.",
      "currentEmployee": true,
      "fullTime": false,
      "tenure": null,
      "role": null,
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 5,
      "title": "Great work experience",
      "date": 20141208,
      "recommend": true,
      "outlook": "positive",
      "ceoOpinion": null,
      "balance": 5,
      "culture": 5,
      "careerOpps": 5,
      "benefits": 4,
      "mgmt": 5,
      "total": 5,
      "pros": "Supportive management, exciting goals, many learning opportunities and potential for growth",
      "cons": "It's a big department, so it can be hard to get to know everyone. Stand out by making a name for yourself through solid work ethic and networking",
      "advice": null,
      "currentEmployee": true,
      "fullTime": true,
      "tenure": ">3",
      "role": "Associate Director",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 6,
      "title": "Good part time job",
      "date": 20190318,
      "recommend": null,
      "outlook": null,
      "ceoOpinion": null,
      "balance": null,
      "culture": null,
      "careerOpps": null,
      "benefits": null,
      "mgmt": null,
      "total": 4,
      "pros": "Good balance and understanding of other priorities",
      "cons": "tasks were tedious and sometimes felt like they had little impact, but have to be done",
      "advice": null,
      "currentEmployee": false,
      "fullTime": false,
      "tenure": ">1",
      "role": "Student Worker",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 7,
      "title": "Overall Great Place to Work",
      "date": 20190314,
      "recommend": null,
      "outlook": null,
      "ceoOpinion": null,
      "balance": 5,
      "culture": 5,
      "careerOpps": 3,
      "benefits": 3,
      "mgmt": 2,
      "total": 4,
      "pros": "Great benefits, access to university resources in addition to department and/or school-specific resources, pretty easy to maintain work-life balance (40/hr work week)",
      "cons": "No substantial bonuses/ salary increases based on merit, not much room for growth unless you switch departments or job functions",
      "advice": null,
      "currentEmployee": true,
      "fullTime": true,
      "tenure": ">3",
      "role": "Senior Program Coordinator",
      "locationCity": "Chicago",
      "locationState": "IL"
    },

    {
      "id": 8,
      "title": "Temporary Center Review",
      "date": 20190210,
      "recommend": false,
      "outlook": "negative",
      "ceoOpinion": true,
      "balance": 1,
      "culture": 1,
      "careerOpps": 2,
      "benefits": 1,
      "mgmt": 1,
      "total": 1,
      "pros": "No pros, after being a temporary employee.",
      "cons": "The temp center was just all around confused and Northwestern's general HR seemed very confused at times as well. Misinformation was being sent out on how to set up NUIT logins and the people in charge didn't even realize it, I, the temp employee, had to tell them. The temp center was short two pages of information which caused much confusion for IT and the department on the first day of work, it made me look like a complete moron. Management also failed to respond to emails and had very confusing out of office replies, wrong dates and times for returns. The general HR area also had a difficult time answering very simple questions about applying for permanent employment while being a temp, three different responses to the same question via the telephone.",
      "advice": "You should hire more conscientious and clear communicators to handle the temporary employees. The temp center should also be asking for feedback about the experiences from the temps, as some of these departments didn't even have a place for me to sit and work! A computer and desk were needed were all assignments!",
      "currentEmployee": false,
      "fullTime": true,
      "tenure": ">1",
      "role": "Temporary Employee",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 9,
      "title": "A stepping Stone At Best",
      "date": 20190308,
      "recommend": false,
      "outlook": "negative",
      "ceoOpinion": false,
      "balance": null,
      "culture": null,
      "careerOpps": null,
      "benefits": null,
      "mgmt": null,
      "total": 1,
      "pros": "Slow moving company where doing the minimum gets you by. Good location if you live in the northern suburbs. Next to the Metra. Steady financially so not a high risk of getting laid off. Building is quite nice and there is a nice walking path with ducks.",
      "cons": "First off, you know a company is not great when it has to post fake review to pump up ratings. Overall it's pretty bad. Although Nvision has a little more fun, the culture is an old school boys club with rampant nepotism and favoritism. Time watchers walk around to see who comes in early and leaves late. Systems are old and the workforce is aging. Trouble hiring and keeping young talent because as soon as they see what the company is like they use it as stepping stone and leave. I've seen the owner publicly berate sales people multiple times. Benefits are TERRIBLE. Horrible vacation. WFH is not promoted. Owner claims it's a "family" and that he cares about his employees but hoards millions while everyone else pays an arm and a leg for garbage insurance (good luck finding a dentist). ZERO weeks of paid maternity so I won't even be able to stay with my child. The company has been around for 100 years but thousands of other companies achieved 10x in a quarter of time. Overall it's easy to get in but you will not be staying long.",
      "advice": "I think management knows what to do to make things better but it's all about the owner. And the owner doesn't care because he's stuck in the 70's and is getting his money. So there is really no advice to give. The company will continue to meagerly chug along and brag about how they got the Stanley club that one time a decade ago.",
      "currentEmployee": true,
      "fullTime": true,
      "tenure": ">3",
      "role": "Production Buyer",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 10,
      "title": "Family Owned Chop Shop/Stay Away At All Costs",
      "date": 20180626,
      "recommend": false,
      "outlook": "negative",
      "ceoOpinion": false,
      "balance": null,
      "culture": null,
      "careerOpps": null,
      "benefits": null,
      "mgmt": null,
      "total": 1,
      "pros": "Leaving, best day of my employment was walking out of the front door on the last day.",
      "cons": "This can be much longer but we will stick to the top Cons for now: 1.) No clear strategy, upper management is always reactionary. 2.) Because of number 1 upper management is always looking for ways to assign blame, never to look at what decisions they made and how or why they were wrong. 3.) "Family owned business", owners don't care about their employees and less about their customers, its a cash grab with the only strategy being short term benefit to the ownership. 4.) DO NOT SIGN ANY DOCUMENTATION WITHOUT YOUR PERSONAL ATTORNEY REVIEWING, they like to try and trap their employees with lots of paper work so that if they need to litigate later they can then go after you for your house and or assets . 5.) They will litigate, even if you leave to go off into an unrelated industry they will threaten & harass you before suing you even though they know they don't have a case, but it is what they do because they feel it will inconvenience you for time and money. 6.) Cronyism... Get used to it at NA, middle management is all the close personal pals of certain folks in upper management who only serve to carry out the short term fast money vision of upper management/ownership, also friends of family who also work on the sales team will just start calling on everyone else's existing accounts and if you say anything that is when it gets worse, imagine being 100% commissioned and you have lost more business to your "teammate" due to his family friendship with ownership then your own competition. 7.) Expenses will ultimately be out of pocket, don't expect ownership to pay you back or help you when spending money on company business. 8.) Constant hostile work environment, upper management/ownership hate sales people so they push down an aggressive management style to middle management that involves, threats, berating comments, and middle managers attempting unsuccessfully to micro manage every detail in their sales reps day to day, its why they cant keep great sales reps or operations folks around.",
      "advice": "If ownership cared about their clients and wanted to be seen as a legitimate Chicago based distributor of facility supplies they would clean house, starting with division heads and the middle management they have promoted and then sell the business to someone who actually cares.",
      "currentEmployee": false,
      "fullTime": true,
      "tenure": ">5",
      "role": "Sales",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 11,
      "title": "Operational Project Intern",
      "date": 20180124,
      "recommend": true,
      "outlook": "positive",
      "ceoOpinion": true,
      "balance": null,
      "culture": null,
      "careerOpps": null,
      "benefits": null,
      "mgmt": null,
      "total": 5,
      "pros": "Loved working with Masters in HSM students, people were all very kind and got hands on work and made a difference at the hospital.",
      "cons": "It was an unpaid internship",
      "advice": null,
      "currentEmployee": false,
      "fullTime": false,
      "tenure": ">3",
      "role": "Student",
      "locationCity": null,
      "locationState": null
    },

    {
      "id": 12,
      "title": "Unchallenging",
      "date": 20190402,
      "recommend": false,
      "outlook": "negative",
      "ceoOpinion": null,
      "balance": null,
      "culture": null,
      "careerOpps": null,
      "benefits": null,
      "mgmt": null,
      "total": 1,
      "pros": "It is conveniently located north of the city, and the employees and students were friendly.",
      "cons": "Very little room to grow and/or be promoted. Few opportunities and resources for professional development. The job security of those who have worked there for awhile encourages employees to do as little as possible and to be ambivalent of opportunities for improvement.",
      "advice": "Encourage knowledge-sharing, professional development, and cross-training.",
      "currentEmployee": false,
      "fullTime": false,
      "tenure": "<1",
      "role": "Admissions Evaluator",
      "locationCity": null,
      "locationState": null
    }
  ]
}
